{
  "posts": [
    {
      "id": "1",
      "date": "24/04/2020",
      "author": "nate",
      "title": "Yin Yang Traveling",
      "image": "https://lonelyplanetimages.imgix.net/a/g/hi/t/dcf1e0ec17d14df8fac9a7a57c7af63d-china.jpg?sharp=10&vib=20&w=1200",
      "description": "<p>It was about 12:35pm when we made it to the Taoyuan Airport (TPE). We got picked up my Mom's older brothers and we were pretty much whisked away from the airport into Taipei. As we were driven fro...</p>",
      "content": "<p>It was about 12:35pm when we made it to the Taoyuan Airport (TPE). We got picked up my Mom's older brothers and we were pretty much whisked away from the airport into Taipei. As we were driven from the airport, it immediately felt muggy and hot, and when we were looking out the window from the expressways, we could see how hazy it was as the neighboring hills and mountains couldn't be seen even though they were close.Indeed, it was as if Summer hadn't left Taiwan even though we were well over a month into Autumn by now. It made me wonder if this was the work of Global Warming or if visiting Taiwan was probably best done in late November and December (i.e. their Winter as opposed to Autumn). In any case, we couldn't control the weather, and we knew that we'd have to plan out what we were going to do for the Taiwan part of the trip. This was especially the case since we didn't pre-book anything - no rental car, no hotels or guest houses, no real sense of what we're doing day by day other than my suggested itinerary that I worked out before the trip.It felt strange to do a trip without such arrangements made in advance since this was not what Julie and I normally do. But given the weather (and typhoon aftermath situations), it was probably a good thing that we didn't lock ourselves into a set itinerary on this trip.We made a stop to a Costco along the way (funny, I didn't remember seeing one of these before), but we sought out a Taiwanese GPS so I could at least track where we've been on a map back at home as well as double check against the GPS that would most likely be included in the car rental when we go out and about.One thing that struck me was that they don't sell Garmin GPS' at Costco. Instead, they sold something called Papago, which was both a GPS as well as a video camera. It dawned on me immediately why they did this - because you'll now have a record of what happened on the road when something happens like an accident. I guess this kind of underscored the inherent riskiness of driving in Taiwan, which we felt wasn't the case in Japan.<br></p>"
    },
    {
      "id": "2",
      "date": "24/04/2020",
      "author": "nate_nonpareil",
      "title": "Seeking Out Japan's Top 100",
      "image": "https://www.azamaraclubcruises.com/sites/default/files/heros/qs13i018-circle-japan-intensive.jpg",
      "description": "<p>It was about 9pm when we arrived at LAX, which was quite busy. Mom and Dad used an Uber-like service (or maybe it was an Uber driver, dunno) and I guess he took us on some interesting back roads n...</p>",
      "content": "<p>It was about 9pm when we arrived at LAX, which was quite busy. Mom and Dad used an Uber-like service (or maybe it was an Uber driver, dunno) and I guess he took us on some interesting back roads near Aviation Blvd to get to LAX via Century Blvd. It was an approach we hadn't taken before, but he said it was due to traffic. Had we been in a rush, I kept thinking that it was probably better if we took the lower level for arrivals then walked upstairs to the Tom Bradley Terminal.Anyways, once we were there, we promptly went to the China Airlines counter to get our boarding passes and check in our bags. And by 9:55am, we were waiting for a while at the Gate 154, which was interesting in that we already had known our gate well before the monitors were supposed to tell us our departure gate. I guess this was one example where China Airlines to Taipei probably always had a designated gate or something.I was pretty tired by the time we were in the gate and I badly wanted to just sleep, but I knew that it would be interrupted and uneasy sleep until we'd get onto the plane. Sure enough, I dozed off, and eventually by around 11pm, I woke up again. We pretty much boarded on time at 11:25pm, and then the plane took off shortly after midnight as scheduled.It was hard to fall asleep at first because they kept the lights on until they served dinner. But eventually after the dinner and dozing off to the sounds of Mr and Mrs Smith, that was when I fell asleep for the next 6-7 hours.The sleep wasn't easy because the seats felt kind of hard and they made my bottom sore. So I kept tossing and turning left and right to keep the butt from getting too uncomfortably sore. Still, that ensured that the sleep wasn't going to be that restful, but at least I did get more shut eye than I had been getting for the last two or three weeks due to lots of work and lots of work on the website when I wasn't on the job.<br></p>"
    },
    {
      "id": "3",
      "date": "24/04/2020",
      "author": "nate_nonpareil",
      "title": "Black Nostrils",
      "image": "https://www.intrepidtravel.com/sites/intrepid/files/styles/low-quality/public/elements/product/hero/japan_tokyo_fluro-advertising-on-buildings.jpg",
      "description": "<p><span style=\\\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\\\">The day began with a becoming-normal wake-up at 5:45am. With a real quick morning breakfast, we left the hotel at 7:15a...</p>",
      "content": "<p><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">The day began with a becoming-normal wake-up at 5:45am. With a real quick morning breakfast, we left the hotel at 7:15am and were at the Delhi airport shortly thereafter.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">When we got to check in at 7:50am, we suddenly learned that our flight was delayed by two hours!</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">Well this really sucks. I guess there are going to be a lot of waterfalls today that we won't get to see.&nbsp;</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">So far, we have yet to see a waterfall on this trip due to unforseen circumstances. Now, it seems a few more waterfalls will elude us.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">Will we ever be able to see some of India's waterfalls?</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">At 8:35am, I looked up at the monitor again and saw that the new estimated departure time was now 11am!</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">By 9:30am, the EDT was holding steady at 11am. I can't help but to keep glancing at the monitor just so I can catch that moment when the monitor status changes (for better or worse, though I kept fearing the worst).</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">So with all this free time, I did some reading on LP. And perhaps the lack of waterfalls on this trip so far has fueled my delusion because I started fantasizing about a return trip to India focusing on the waterfalls of the more politically unstable Eastern India states of Chhattisgarh, Orissa, and Jharkhand. Perhaps even adding in Sikkim to get close to the Himalayas would also be in order as well...</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">Well, back to reality...</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">It wasn't until around 10:50am when we finally went to gate 15 to start boarding. And it wasn't until 11:50am before the flight finally took off.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">The three-hour delay was sure to ruin the waterfalling today. So mentally, I'm thinking we have to just go for the real big important waterfalls and be prepared for some waterfall casualties.</span><br></p>"
    },
    {
      "id": "4",
      "date": "24/04/2020",
      "author": "nate_nonpareil",
      "title": "Hello, Delhi!",
      "image": "https://www.china-admissions.com/wp-content/uploads/2017/08/12-2017still-open-Great-Wall.jpg",
      "description": "<p><span style=\\\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\\\">It was Sunday morning when I was finished with my 6th consecutive night of working the 3rd shift. The upside-down sleep...</p>",
      "content": "<p><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">It was Sunday morning when I was finished with my 6th consecutive night of working the 3rd shift. The upside-down sleep schedule wreaked havoc on my body, and I was worried as hell about getting sick before this trip.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">But it was finally 6am (no help from the extra hour worked thanks to daylight savings at 2am earlier in the evening). So as tired as I was, I eagerly hopped into the car, said my farewells to the fellow coworkers taking over, and headed straight for home.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">Once I got home about a half-hour later, I got right to taking a much-needed shower as well as a good brushing and flossing. As I was waiting for Julie to finish packing her belongings, I was vacillating between full fledged sleep and groggy consciousness.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">At around 9:15am, I summoned just enough awareness to get our stuff into the car and drove back to LAX in what must've been some of the sleepiest miles I'd ever driven.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">By around 11am, we were done with checking our bags through TSA and securing our boarding passes. We snuck in a last minute meal of overpriced airport food. We also managed to meet up with my parents who happened to be flying to&nbsp;</span><a href=\"https://www.world-of-waterfalls.com/asia-china.html\" style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium; background-color: rgb(255, 255, 255);\">China</a><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">&nbsp;shortly after our departure to India.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">By about 12:45pm, we bid my parents farewell and proceeded to go through the crowded gate area and onto the plane. The plane wouldn't take off for another hour, making us worry about possibly missing one of our connections later on today. But in any case, we finally took off some time near 1:45pm, which was later than the scheduled 1:10pm departure.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">I managed to get some necessary Zs (finally!) while on the 11-hour flight so that made much of the flight go by pretty fast. But when I awoke for good momentarily, the plane seemed to be rocking as we were in the midst of some serious turbulence that never seemed to end. When things calmed down, I managed to squeeze in a movie of G.I. Joe, which I thought was pathethic.&nbsp;</span><br></p>"
    },
    {
      "id": "5",
      "date": "24/04/2020",
      "author": "nate_nonpareil",
      "title": "Where's Your Head At?",
      "image": "https://imagesvc.timeincapp.com/v3/mm/image?url=https%3A%2F%2Fcdn-image.travelandleisure.com%2Fsites%2Fdefault%2Ffiles%2Fstyles%2F1600x1000%2Fpublic%2F1521564572%2Fblossoms-JCBUPDATE0318.jpg%3Fitok%3DiBRyS6hE&w=700&q=85",
      "description": "<p><span style=\\\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\\\">We got to sleep in a little bit and take some extra time to prepare for today's flight. We weren't taken to the airport...</p>",
      "content": "<p><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">We got to sleep in a little bit and take some extra time to prepare for today's flight. We weren't taken to the airport until around 11am.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">When we got to the airport some 15 minutes later, we said our farewells to both Tir and Ruad in the familiar bowing with hands in prayer position gesture saying \"Ah kohn.\" That gesture is the same as what's used in Thailand and I reckon it must be a trait of the Buddhist-influenced societies prevalent in these parts of southeast Asia.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">The flight via Bangkok Air to the Suvarnabhumi Airport was smooth and without incident. We had a nearly 5 hour layover at this airport so I took that time to blog and compose these travel story entries.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">We had one last round of Thai food at one of their restaurants on the 4th floor, but this one was the worst of the lot. We had pad thai and som tam as well as a pair of Thai iced tea. It was overpriced, too.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">When it was almost 5pm, we waited by our gate for our departure to Hong Kong by Cathay Air just a half-hour later. I chose to use this time to brush my teeth though we didn't have any drinking water with us.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">I started to get the chills as we were about the board the plane. While we were on this 2.5-hour flight, the chills worsened quickly and suddenly everything felt cold. The chills intensified especially towards the end of the flight.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">We had a short 1-hour layover in Hong Kong. So while we worried about being tied up in security and in long queues, I was also glad I didn't have to wait long before our flight.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">By this point I was really getting the chills. While we were busy being herded through security and then quickly walking to our transfer gate, my teeth were chattering even though we were moving fast and I was fully clothed in fleece jacket, long pants, a hiking shirt, and wool socks.&nbsp;</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">I was looking forward to the plane ride partially to at least try to get some sleep and fight off this apparent fever. But at the same time, I wasn't looking forward to the flight because it was going to be over 13 hours and if I don't manage to sleep most of the time, it was gonna be one hell of a long flight.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">\"Honey. That's now the third time you've got food poisoning. When will you learn?\" said Julie.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">We boarded our 11:45pm flight on time, but as I was trying to get settled and try to will myself to sleep with chills, nausea, etc. we were apparently stuck in the plane for another hour or so due to a malfunctioning antenna or whatever the captain said that hindered communications with air traffic control. So we had to wait for the part to show up and get installed.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">Eventually, the flight did take off (I lost track of time at that point).</span><br></p>"
    },
    {
      "id": "6",
      "date": "24/04/2020",
      "author": "nate_nonpareil",
      "title": "The Home Away From Home",
      "image": "https://travel.maggiesdoughnuts.com/wp-content/uploads/2015/03/Best-Travel-Places-in-Asia.jpg",
      "description": "<p><span style=\\\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\\\">After leaving Guiyang under rainy skies (the first time we faced this on the Guizhou part of the trip) at 8am, we manag...</p>",
      "content": "<p><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">After leaving Guiyang under rainy skies (the first time we faced this on the Guizhou part of the trip) at 8am, we managed to arrive in Chengdu, Sichuan Province and meet up with our guide there named Simpson at 9:30am.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">It also looked like it was raining over here (the wet ground was a dead giveaway), but the air felt a little crisp and cool and the intensity of the rains was nothing more than fair to drizzly.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">Simpson seemed to speak and comprehend English better than the other guides on this trip up to this point. So we conversed about a bunch of random things (despite his usually quiet demeanor) during our drive to the Panda Research and Breeding Center about 10km out of the city of Chengdu.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">One thing that was immediately noticeable was that the traffic (although still chaotic) was quite noticeably a little more laxed than the crazy chaos we saw in both Guiyang and Nanning. And keep in mind Chengdu is a sprawling city of 11 million people!!!!!!</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">Simpson attributed this to Sichuan's quite westerly location, which is somewhat further away from the factories and ports on the eastern side of the country. Plus, a lot of the factories that were here previously went east so the particulates in the air from pollution (from factory emissions) was clearing up.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">This was also an opportunity to try to establish contact with my relatives (related through my grandma) who live in Leshan about 2 hours south of Chengdu by car. It was going to be tricky because we didn't really know what they looked like and we were totally going on directions and phone numbers that my parents provided prior to coming here. Plus with the language difficulties, you could imagine our nervousness about this particular leg of the trip, especially considering it won't be by paid escorted tour.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">Speaking of which, it was kind of a weird arrangement since we'd only be with our guide and driver on the panda part of this trip and on the airport shuttles to and from Leshan.</span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">Anyways, at 10:15am, we made it to the Panda Research and Breeding Center. </span><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><br style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\"><span style=\"font-family: Verdana, Geneva, sans-serif; font-size: medium;\">The first thing we noticed was a lot of foreigners here (noticeably a pretty large German group). This was actually something we hadn't seen since we were on the Li River between Guilin and Yangshuo. So for sure, we knew this particular spot was very popular in the eyes of the world apparently.</span><br></p>"
    },
    {
      "id": "7",
      "date": "24/3/2020",
      "author": "BAN168",
      "title": "Namib",
      "image": "https://businesstech.co.za/news/wp-content/uploads/2018/01/Orient-Express-01.jpg",
      "description": "<p>vhgukehufqebvjkvguadhvmndjh</p>\"...</p>",
      "content": "<p>vhgukehufqebvjkvguadhvmndjh</p>"
    }
  ],
  "users": [
    {
      "id": "1",
      "username": "nate_nonpareil",
      "email": "nate.mbaku@gmail.com",
      "password": "jeff"
    },
    {
      "id": "2",
      "username": "Mike",
      "email": "mike@rmail.com",
      "password": "mike"
    },
    {
      "id": "3",
      "username": "wahhaaj",
      "email": "wahhaajdavids@gmail.com",
      "password": "wahhaaj"
    },
    {
      "id": "4",
      "username": "phili",
      "email": "phili@gami.naruto",
      "password": "phili@gami"
    },
    {
      "id": "5",
      "username": "BAN168",
      "email": "nate@7441sa.com",
      "password": "7441sa123"
    }
  ]
}